import "./about-us.scss";
import Title from "../../Components/Titles/Title";
import img from "../../assets/icons/who we are page.svg";
function AboutUs() {
  return (
    <div className="about-us">
      <div className="container">
        <Title title="من نحن وما هي رؤيتنا؟" />
        <div className="info">
          <img src={img} alt="" />
          <p>
            نحن فريق من المبدعين والمتخصصين في مجال تصميم وتطوير المواقع
            الإلكترونية، نسعى إلى تقديم حلول رقمية مبتكرة تساعد على تعزيز حضور
            عملائنا في العالم الرقمي. منذ تأسيسنا، كان هدفنا الأساسي هو توفير
            تجارب رقمية متكاملة وفعّالة تعكس هوية العلامة التجارية لكل عميل على
            حدة. نؤمن بأن لكل مشروع تحدياته وفرصه الفريدة، ولهذا نحرص على تخصيص
            استراتيجياتنا بما يتناسب مع احتياجات وتطلعات عملائنا. فريقنا يضم
            مصممين، مطورين، ومحللي بيانات يعملون معاً بتنسيق تام لتقديم مواقع
            إلكترونية تفاعلية وسهلة الاستخدام تعتمد على أحدث التقنيات. نحن هنا
            ليس فقط لإنشاء مواقع جميلة، بل لتطوير حلول تقنية توفر لك الأداء
            والكفاءة التي تحتاجها لتنمية أعمالك. وبفضل التزامنا بالجودة
            والتفاصيل، نستطيع تقديم تجارب رقمية متميزة تلبي تطلعات عملائنا
            وتساعدهم في تحقيق النجاح في السوق الرقمي المتزايد التعقيد.
          </p>
        </div>
      </div>
    </div>
  );
}

export default AboutUs;
