import { IoMdAnalytics } from "react-icons/io";
import { GrHostMaintenance } from "react-icons/gr";
import { FaLaptopCode } from "react-icons/fa";
import { MdDesignServices } from "react-icons/md";

const Section4Data = [
  {
    id: 1,
    title: "تحليل",
    paragraph:
      "نحرص على تحليل البيانات التي يقدمها العميل بعناية لضمان تقديم حلول رقمية مخصصة تلبي احتياجاته بدقة. من خلال فهم عميق للمعلومات المقدمة، مثل متطلبات العمل، وفئات الجمهور المستهدف، وأهداف المشروع، نقوم بتطوير استراتيجيات فعّالة وملائمة. هذا التحليل يساعدنا على تصميم وتطوير مواقع إلكترونية تعكس هوية العلامة التجارية وتحقق النتائج المرجوة، مما يضمن تجربة مستخدم سلسة ومتوافقة مع رؤية العميل.",
    icon: <IoMdAnalytics />,
  },
  {
    id: 2,
    title: "تصميم",
    paragraph:
      "في تصميم المواقع الإلكترونية، نركز على دمج الإبداع مع تجربة المستخدم لتحقيق توازن مثالي بين الجمال والوظائف. نسعى لفهم هوية العلامة التجارية للعميل لنصمم واجهات جذابة تعكس رؤيته وتترك انطباعًا دائمًا لدى الزوار. نعمل على تصميم مواقع متجاوبة وسهلة الاستخدام، بحيث توفر تجربة سلسة على مختلف الأجهزة والمنصات، مع مراعاة التفاصيل الدقيقة التي تجعل التصميم فريداً وفعّالاً.",
    icon: <MdDesignServices />,
  },
  {
    id: 3,
    title: "تتفيذ",
    paragraph:
      "في تطوير المواقع الإلكترونية، نلتزم باستخدام أحدث التقنيات لبناء أنظمة قوية وسريعة الاستجابة. نعمل على تطوير مواقع مرنة وقابلة للتوسّع، تتوافق مع احتياجات العميل المستقبلية وتنمو مع أعماله. نهتم بتقديم حلول برمجية متكاملة تضمن أداءً عاليًا وسهولة في الاستخدام، مع التركيز على الأمان والتوافق مع مختلف المتصفحات والأجهزة. هدفنا هو تقديم تجربة تطوير تضمن استدامة الموقع وتفوقه في السوق الرقمي.",
    icon: <FaLaptopCode />,
  },
  {
    id: 4,
    title: "اختبار و صيانة",
    paragraph:
      "نحن ندرك أهمية الصيانة والاختبار لضمان استمرارية أداء الموقع بأعلى كفاءة. نقوم بإجراء اختبارات شاملة قبل إطلاق الموقع وبعده للتأكد من خلوه من الأخطاء وتحسين أدائه على جميع الأجهزة والمتصفحات. كما نوفر خدمات صيانة دورية لمتابعة تحديثات الأمان، وحل المشكلات التقنية بسرعة، وضمان عمل الموقع بسلاسة على مدار الساعة. هدفنا هو أن يبقى موقعك محدثًا وفعالاً لضمان أفضل تجربة للمستخدم.",
    icon: <GrHostMaintenance />,
  },
];

export default Section4Data;
